Revit 2027 API
BuiltInFailures.SketchFailures.ElevationSketchNotAllowed Property
 Wall in a family can't have an elevation profile.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ElevationSketchNotAllowed { get; }
Public Shared ReadOnly Property ElevationSketchNotAllowed As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ElevationSketchNotAllowed {
	FailureDefinitionId^ get ();
}
static member ElevationSketchNotAllowed : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace